In [1]:
import pandas as pd

In [45]:
test_score = pd.read_csv('../cleaned_data/state_grade_composite_scores_1996_2022_clean.csv')
internet = pd.read_csv('../cleaned_data/USA_internet_access_state.csv')

In [46]:
test_score.head()

   year  grade state jurisdiction      subject  composite_score
0  1996      4    AL     National  mathematics       222.034757
1  1996      8    AL     National  mathematics       268.797474
2  1996      4    AK     National  mathematics       222.034757
3  1996      8    AK     National  mathematics       268.797474
4  1996      4    AZ     National  mathematics       222.034757

In [47]:
internet.head()

,Year,State,Individuals (thousands),Percent Individuals 3 - 17,Individuals 3 - 17 (thousands),Individuals 3 - 17
0,2001,.Alabama,1674,22.24%,372,372391
1,2001,.Alaska,377,22.24%,84,83774
2,2001,.Arizona,2637,22.24%,586,586415
3,2001,.Arkansas,1024,22.24%,228,227795
4,2001,.California,16927,22.24%,3765,3764649

In [48]:
internet = internet.drop(internet.columns[[2,3,4]], axis=1)
internet['State'] = internet['State'].str.strip('.')

In [49]:
internet.head()

   Year       State  Individuals 3 - 17
0  2001     Alabama              372391
1  2001      Alaska               83774
2  2001     Arizona              586415
3  2001    Arkansas              227795
4  2001  California             3764649

#### I need to replace all the state abbreviations in the test_score data frame with the full name of state

In [50]:
state_abbreviations = {
    'AL': 'Alabama',
    'AK': 'Alaska',
    'AZ': 'Arizona',
    'AR': 'Arkansas',
    'CA': 'California',
    'CO': 'Colorado',
    'CT': 'Connecticut',
    'DE': 'Delaware',
    'FL': 'Florida',
    'GA': 'Georgia',
    'HI': 'Hawaii',
    'ID': 'Idaho',
    'IL': 'Illinois',
    'IN': 'Indiana',
    'IA': 'Iowa',
    'KS': 'Kansas',
    'KY': 'Kentucky',
    'LA': 'Louisiana',
    'ME': 'Maine',
    'MD': 'Maryland',
    'MA': 'Massachusetts',
    'MI': 'Michigan',
    'MN': 'Minnesota',
    'MS': 'Mississippi',
    'MO': 'Missouri',
    'MT': 'Montana',
    'NE': 'Nebraska',
    'NV': 'Nevada',
    'NH': 'New Hampshire',
    'NJ': 'New Jersey',
    'NM': 'New Mexico',
    'NY': 'New York',
    'NC': 'North Carolina',
    'ND': 'North Dakota',
    'OH': 'Ohio',
    'OK': 'Oklahoma',
    'OR': 'Oregon',
    'PA': 'Pennsylvania',
    'RI': 'Rhode Island',
    'SC': 'South Carolina',
    'SD': 'South Dakota',
    'TN': 'Tennessee',
    'TX': 'Texas',
    'UT': 'Utah',
    'VT': 'Vermont',
    'VA': 'Virginia',
    'WA': 'Washington',
    'WV': 'West Virginia',
    'WI': 'Wisconsin',
    'WY': 'Wyoming'
}

def replace_state_abbreviations(text):
    for abbreviation, full_name in state_abbreviations.items():
        text = text.replace(abbreviation, full_name)
    return text

In [52]:
test_score['state'] = test_score['state'].apply(replace_state_abbreviations)

In [53]:
test_score.head()

   year  grade    state jurisdiction      subject  composite_score
0  1996      4  Alabama     National  mathematics       222.034757
1  1996      8  Alabama     National  mathematics       268.797474
2  1996      4   Alaska     National  mathematics       222.034757
3  1996      8   Alaska     National  mathematics       268.797474
4  1996      4  Arizona     National  mathematics       222.034757

In [56]:
internet.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 357 entries, 0 to 356
Data columns (total 3 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Year                357 non-null    int64
 1   State               357 non-null    object
 2   Individuals 3 - 17  357 non-null    int64
dtypes: int64(2), object(1)
memory usage: 8.5+ KB

In [58]:
test_score.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2450 entries, 0 to 2449
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   year             2450 non-null   int64
 1   grade            2450 non-null   int64
 2   state            2450 non-null   object
 3   jurisdiction     2450 non-null   object
 4   subject          2450 non-null   object
 5   composite_score  2450 non-null   float64
dtypes: float64(1), int64(2), object(3)
memory usage: 115.0+ KB

In [54]:
internet_testscore = pd.merge(internet, test_score, 
                               left_on = ('Year', 'State'), right_on = ('year', 'state'), 
                               how = 'left')

In [61]:
internet_testscore = internet_testscore.dropna()

In [62]:
internet_testscore

,Year,State,Individuals 3 - 17,year,grade,state,jurisdiction,subject,composite_score
51,2003,Alabama,483547,2003.0,4.0,Alabama,State,mathematics,223.344643
52,2003,Alabama,483547,2003.0,4.0,Alabama,State,reading,207.083848
53,2003,Alabama,483547,2003.0,8.0,Alabama,State,mathematics,261.939022
54,2003,Alabama,483547,2003.0,8.0,Alabama,State,reading,253.172594
55,2003,Alaska,90879,2003.0,4.0,Alaska,State,mathematics,232.991654
...,...,...,...,...,...,...,...,...,...
901,2011,Wisconsin,958069,2011.0,8.0,Wisconsin,State,reading,267.167030
902,2011,Wyoming,91323,2011.0,4.0,Wyoming,State,mathematics,243.874435
903,2011,Wyoming,91323,2011.0,4.0,Wyoming,State,reading,224.062278
904,2011,Wyoming,91323,2011.0,8.0,Wyoming,State,mathematics,287.767926
905,2011,Wyoming,91323,2011.0,8.0,Wyoming,State,reading,269.568730

In [63]:
internet_testscore.corr()

,Year,Individuals 3 - 17,year,grade,composite_score
Year,1.000000e+00,1.089208e-01,1.000000e+00,-1.385133e-15,0.067899
Individuals 3 - 17,1.089208e-01,1.000000e+00,1.089208e-01,-1.037684e-16,-0.017245
year,1.000000e+00,1.089208e-01,1.000000e+00,-1.385133e-15,0.067899
grade,-1.385133e-15,-1.037684e-16,-1.385133e-15,1.000000e+00,0.886552
composite_score,6.789863e-02,-1.724483e-02,6.789863e-02,8.865524e-01,1.000000

#### correlation coefficient for test scores and child internet access is -0.017

In [65]:
internet_testscore['grade'] = internet_testscore['grade'].astype(int)

C:\Users\alecb\AppData\Local\Temp\ipykernel_21152\2662817566.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  internet_testscore['grade'] = internet_testscore['grade'].astype(int)

In [66]:
internet_testscore.head()

,Year,State,Individuals 3 - 17,year,grade,state,jurisdiction,subject,composite_score
51,2003,Alabama,483547,2003.0,4,Alabama,State,mathematics,223.344643
52,2003,Alabama,483547,2003.0,4,Alabama,State,reading,207.083848
53,2003,Alabama,483547,2003.0,8,Alabama,State,mathematics,261.939022
54,2003,Alabama,483547,2003.0,8,Alabama,State,reading,253.172594
55,2003,Alaska,90879,2003.0,4,Alaska,State,mathematics,232.991654

In [67]:
internet_testscore.to_csv('USA_internet_testscore.csv', index = False)